Tekla Open API Reference for Tekla Structures 2025
ClipPlane.Insert Method
 Creates a new clip plane to the application view. The application view must be visible.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Insert()
Public Function Insert As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
ClipPlane Class
Tekla.Structures.Model.UI Namespace